In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data =[10,20,30]
arr=np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
# craete a pandas series
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
# craete a pandas series with custom labels
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# short way to craete a pandas series with custom labels
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
# create a pandas series from a numpy array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
#craete a pandas series from a dictionary 
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
#using pandas series index to find data
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA']

np.int64(1)

In [12]:
ser3 = pd.Series(data=labels)
ser3[0]

'a'

In [13]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
#when we add two pandas serieses then python will look for common indexes and add them, and will also convert integers to floats.

### DataFrames ###

In [15]:
from numpy.random import randn
np.random.seed(101) # finxing a seed to keep the same random numbers

In [16]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
#find how many rows & columns are there in a df:
df.shape
#df.shape method returns a tuple

(5, 4)

In [18]:
#select a column in a df
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
#one column selected from a df is of series datatype. This shows a df is a group of series linked to the same index (rows)
type(df['W'])

pandas.core.series.Series

In [20]:
#to find multiple columns from a df, pass a list of column names
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [21]:
#to create a new column, write the new column as if it already exists and assign the values
df['new']= df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
#to drop a colum use the drop function, followed by the column name , and set axis = 1
#df.drop by itself wont delete the column from the dataframe, it will just exlude to include the specified columns in the current line
#to delete the column, we need to pass inplace=TRUE
print(df.drop('new',axis =1))
print(df)

df.drop('new',axis =1, inplace=True)
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
#df.drop can also be used for rows, just select axis =0 or dont mention axis at all, default is rows
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
""" there are two ways to access rows in a df:
one by using row labels: using df.loc
2nd by using row indexes: using df.iloc
rows are also stored as series with column names being the index of items in each row
"""

df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [25]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [26]:
# to select 1 item in a df:
df.loc['B','Y']

np.float64(-0.8480769834036315)

In [27]:
# to select a subset matrix in a df:
df.loc[['A','B'],['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

# Conditional Selection #

In [28]:
# if we want to filter for all the rows where a condition is met from values in one column:
bool_df = df['W'] > 0
print(bool_df)
df[bool_df]

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
#in one step:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
#to select just one or few columns from the result of a conditional filter df, use:
result_df=df[df['W']>0]
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
#on in one step:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [32]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [33]:
#multiple filtering conditions: use & for and and | for or
# where W values are > 0 and Y are > 1
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# where W values are > 0 OR Y are > 1
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Reset index

In [ ]:
#this reets the index to 0,1,.. and changes the current index to a new column named 'index'
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
new_index = 'CA NY WY OR CO'.split()

In [37]:
#to change the index to a new column
df['states']=new_index
print(df)

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [38]:
df.set_index('states') # this removes the old index

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [39]:
#multi index and index hierarchy 
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [40]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [41]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [42]:
#access items in a df by using multi-index
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [43]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [44]:
df.loc['G1'].loc[1]['B']

np.float64(1.693722925204035)

In [45]:
#find index names
df.index.names

FrozenList([None, None])

In [46]:
#set index names
df.index.names=['Group','Num']

In [47]:
# use the cross section method
df.xs(1,level='Num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

### Missing Values

In [48]:
d={'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [49]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:
#dropna function to drop any rows with any NaN values in it
df.dropna()

     A    B  C
0  1.0  5.0  1

In [51]:
#dropna function to drop any columns with any NaN values in it
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [52]:
#dropna with a threshold - here the threshold is at least 2 not null values in any row
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [53]:
#fillna to fill the missing values
df=df.fillna(value=df.mean())
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

### GroupBy ###

In [54]:
#Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [55]:
print(df.groupby('Company').sum())
#print(df.groupby('Company').mean())
print(df.groupby('Company').min())

print(df.drop(columns='Person').groupby('Company').mean())
print(df.groupby('Company').max())

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464
          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0
          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [56]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Concat or Merge DataFrames

there are three ways to combine DFs:
concat: simple stacking;

merge: merge based on a common column ;

join: join based on common index

In [57]:
# create 3 dfs

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [58]:
# concat dfs (by default on rows), stacks dfs one below the other
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [59]:
# concat dfs on columns, stacks dfs one after the other - key thing to note is if the dfs being concat'd have different index, then it gets messy

pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
#adding keys in each df for merging
df1['key'] = 'K' + np.arange(len(df1)).astype(str)
df2['key'] = 'K' + np.arange(len(df2)).astype(str)
df3['key'] = 'K' + np.arange(len(df3)).astype(str)


print(df1)
print(df2)
print(df3)

    A   B   C   D key
0  A0  B0  C0  D0  K0
1  A1  B1  C1  D1  K1
2  A2  B2  C2  D2  K2
3  A3  B3  C3  D3  K3
    A   B   C   D key
4  A4  B4  C4  D4  K0
5  A5  B5  C5  D5  K1
6  A6  B6  C6  D6  K2
7  A7  B7  C7  D7  K3
      A    B    C    D key
8    A8   B8   C8   D8  K0
9    A9   B9   C9   D9  K1
10  A10  B10  C10  D10  K2
11  A11  B11  C11  D11  K3

In [61]:
merge_df=pd.merge(df1,df2,how='inner',on='key')
print(merge_df)

merge_df=pd.merge(merge_df,df3,how='inner',on='key')
print(merge_df)

  A_x B_x C_x D_x key A_y B_y C_y D_y
0  A0  B0  C0  D0  K0  A4  B4  C4  D4
1  A1  B1  C1  D1  K1  A5  B5  C5  D5
2  A2  B2  C2  D2  K2  A6  B6  C6  D6
3  A3  B3  C3  D3  K3  A7  B7  C7  D7
  A_x B_x C_x D_x key A_y B_y C_y D_y    A    B    C    D
0  A0  B0  C0  D0  K0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  K1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  K2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  K3  A7  B7  C7  D7  A11  B11  C11  D11

In [62]:
#same can be done by using the join statement
print(df1)
#When joining DataFrames that have overlapping column names, you need to specify suffixes to distinguish between them
df1.join(df2, how='inner',lsuffix=1,rsuffix=2).join(df3,how='inner')

    A   B   C   D key
0  A0  B0  C0  D0  K0
1  A1  B1  C1  D1  K1
2  A2  B2  C2  D2  K2
3  A3  B3  C3  D3  K3

Empty DataFrame
Columns: [A1, B1, C1, D1, key1, A2, B2, C2, D2, key2, A, B, C, D, key]
Index: []

### Dataframe operations

In [63]:
# print first 5 rows 
df1.head()

    A   B   C   D key
0  A0  B0  C0  D0  K0
1  A1  B1  C1  D1  K1
2  A2  B2  C2  D2  K2
3  A3  B3  C3  D3  K3

In [64]:
#find all the unique values in a column
df1['A'].unique()

array(['A0', 'A1', 'A2', 'A3'], dtype=object)

In [65]:
#find the count of all the unique values in a column
df1['A'].nunique()

4

In [66]:
#find the count of each of the unique values in a column
df1['A'].value_counts()

A
A0    1
A1    1
A2    1
A3    1
Name: count, dtype: int64

In [67]:
#apply a custom fuction to all the values in a column in a df

def small_caps(x):
    return x.lower()

df1['A'].apply(small_caps)

0    a0
1    a1
2    a2
3    a3
Name: A, dtype: object

In [68]:
#apply by using lambda expression

df1['A'].apply(lambda x: x.upper())

0    A0
1    A1
2    A2
3    A3
Name: A, dtype: object

In [69]:
# to drop a column
#df1.drop('A',axis=1,inplace=True)

In [70]:
#to find the list of all the column names in a df
df1.columns

Index(['A', 'B', 'C', 'D', 'key'], dtype='object')

In [71]:
#sort the df by values in a column
df1.sort_values(by='D')

    A   B   C   D key
0  A0  B0  C0  D0  K0
1  A1  B1  C1  D1  K1
2  A2  B2  C2  D2  K2
3  A3  B3  C3  D3  K3

In [72]:
# to return a bool df with true for null values
df1.isnull()

       A      B      C      D    key
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False

In [73]:
#pivot table of a df
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [74]:
df.pivot_table(values='D',index=['A','B'],columns='C',aggfunc='sum')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [75]:
df.pivot_table(values='D',index=['A','B'],columns='C',aggfunc='mean')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### I/O ops in pandas

In [76]:
#make sure that the CSV and other files are stored in the same location where this jupyter notebook is. use pwd command to see where is the notebook

In [77]:
pwd

'c:\\Users\\heyanand\\Documents\\MS-DS\\GitHub Repos\\Python-pre learn\\python\\03 pandas'

In [78]:
# read csv
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [79]:
df=pd.read_csv('demand(154).csv')
df=df.fillna(value=0)
df.head()

,polygon,region,super_region,demand,baseline_3p,force_open,force_closed,force_assign,force_assign_region,force_assign_super_region,force_node_not_assign,spozh_coef_b0,spozh_coeff_b1,area,attainment,spozh_model,actual_spozh_min
0,Z01-DE-DUS-84910,Ruhr_Bochum,DE,2908.927570,3.353639,True,False,False,False,True,0.0,-4.928810,9.225224,25.928203,1,log_density_90_days,1
1,Z01-DE-RLG-52000,Rostock,DE,2307.510878,3.384389,True,False,False,False,True,0.0,14.858096,3.978853,42.128023,1,log_density_90_days,1
2,Z01-DE-LHA-53800,Freiburg,DE,2537.621858,3.360326,True,False,False,False,True,0.0,36.747705,0.309025,81.503441,1,log_density_90_days,1
3,Z01-DE-NUE-29410,Nuremberg,DE,2250.740053,3.360326,True,False,False,False,True,0.0,11.645822,8.952579,94.931117,1,log_density_90_days,1
4,Z01-DE-CGN-41100,Rheinland_Cologne,DE,2731.748098,3.360326,True,False,False,False,True,0.0,3.847679,9.451325,94.745592,1,log_density_90_days,1

In [80]:
#save a df as a csv; index is set to false else row and column indexes are added as columns in the output csv
df.to_csv('clean_demand.csv', index = False)

In [81]:
import sys
#import openpyxl
#reading excel or .xlsx into pandas df. pandas read excel as one df for each sheet and cannot read formatting or formulas
df_demand = pd.read_excel('excel_inputs.xlsx',sheet_name='demand')
df_demand.head()

,polygon,region,super_region,demand,baseline_3p,force_open,force_closed,force_assign,force_assign_region,force_assign_super_region,force_node_not_assign,spozh_coef_b0,spozh_coeff_b1,area,attainment,spozh_model,actual_spozh_min
0,Z01-DE-DUS-84910,Ruhr_Bochum,DE,2908.927570,3.353639,True,False,False,False,True,NaN,-4.928810,9.225224,25.928203,1,log_density_90_days,1
1,Z01-DE-RLG-52000,Rostock,DE,2307.510878,3.384389,True,False,False,False,True,NaN,14.858096,3.978853,42.128023,1,log_density_90_days,1
2,Z01-DE-LHA-53800,Freiburg,DE,2537.621858,3.360326,True,False,False,False,True,NaN,36.747705,0.309025,81.503441,1,log_density_90_days,1
3,Z01-DE-NUE-29410,Nuremberg,DE,2250.740053,3.360326,True,False,False,False,True,NaN,11.645822,8.952579,94.931117,1,log_density_90_days,1
4,Z01-DE-CGN-41100,Rheinland_Cologne,DE,2731.748098,3.360326,True,False,False,False,True,NaN,3.847679,9.451325,94.745592,1,log_density_90_days,1

In [82]:
#reading HTML in pandas df
df_html= pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [83]:
from sqlalchemy import create_engine

In [84]:
import sys
print(sys.executable)

c:\Users\heyanand\Documents\MS-DS\GitHub Repos\Python-pre learn\python\.venv\Scripts\python.exe

In [85]:
import sys
print(sys.executable)

c:\Users\heyanand\Documents\MS-DS\GitHub Repos\Python-pre learn\python\.venv\Scripts\python.exe